{
    "abstract": "The rapid growth in digitization of data has led to\ncreation of fragmented but vital knowledge sources.\nOntologies are one such crucial source of knowledge\nand aligning them is a key challenge for creating an\nOpen Knowledge Network. The task of ontology\nalignment has received significant attention. In this\nabstract, we building on existing work, and propose a\nnovel probabilistic ontology alignment approach that\ncombines several similarity measures with structural\ninformation such as subsumption and mutual exclusion.\nMost large-scale ontologies such as product catalogs\n[Agrawal et. al. 2001] and folksonomies [Plangprasopchok et. al. 2010] do not have a formally defined ontology with well-defined classes, instances and properties. Instead, they loosely define relationships such as\nsubsumption between various entities. For example, a\nfolksonomy for Instagram would contain not only tags\ncorresponding to people, places and activities but also\ntags such as Selfie, which correspond to a type of image.\nProduct catalogs have very different textual representation for the same entity. For instance, products related to\n3D printing are present in a category called 3D Printing\n\\& Supplies on Ebay, while the same products are present\nin a category called Additive Manufacturing Products\non Amazon. Moreover, the same textual representation\nmight have different semantics based on the source of\nthe ontology. The category Headphones in an ontology\ncorresponding to a particular company is different from\nthe Headphones category of a large e-commerce retailer\nsuch as Amazon. Even aligning tracks in a music catalog\nis considerably challenging as it is unclear whether the\ntracks Bohemian Rhapsody OST and Bohemian Rhapsody Remastered 201l are the same. To sum up, ontology\nalignment is challenging due to informally defined subsumptions, multiple textual representations for the same\nclass, ambiguity of similar textual representations and\npresence of large number of instance variations .\nExisting ontology alignment approached can be classified into schema-based approaches, instance-based\napproaches and hybrid approaches [Euzenat et. al.\n2007]. Hybrid approaches such as InformationFlow-based Map [Kalfoglou et. al., 2003] combines\nstring-based heuristics and the structure of the ontology\nto generate alignments. Naive Ontology Mapping [Ehrig\net. al., 2004] makes uses of rules that exploit information\npresent in the ontology.\nMotivated by these hybrid methods, our proposed ontology alignment approach combines several similarity\nand distance scores with soft structural constraints.\nWe then define a probability distribution over the\nset of all possible alignments that takes into account\ncorrelations between different alignments. Apart from\nsimilarity scores computed on the textual representation\nof entities, we also compute scores using the entity\nhierarchy described by the subsumption relations. This\nhelps in identifying the semantics on each entity. Apart\nfrom structural constraints such as mutual exclusion,\nwe also incorporate relation specific constraints. For\ninstance, it is unlikely that multiple entities that have\na parent-child relationship align to a single entity. We\nuse Probabilistic Soft Logic(PSL)[Bach et. al. 2017],\na powerful probabilistic programming framework, that\nuses weight first-order logic rules to define a probability\ndistribution. Having defined the distribution, we use the\nefficient MAP inference supported by PSL to identify\nthe most likely alignment.\nWe performed experiments on product taxonomies\nextracted from four websites and compared our method\nto a tf-idf similarity score based approach. While\nthe instance-based similarity score prevented aligning\ncategories such as bicycle stands \\& storage and storage\n\\& home organization, the structural constraints helped\ndistinguish between equivalence and more general\nrelations. For example, beauty \\& personal care was\naligned to beauty and not hair care, even though there\nis a significant overlap of products, as hair care was the\nchild of beauty in the product taxonomy. In summary,\ncombining multiple scores and structural constraints using a probabilistic framework led to a 36\\% improvement\nin precision and a 15\\% improvement t in F1 score over\nthe string similarity baseline.",
    "year": "2019",
    "title": "Collective Alignment of Large-scale Ontologies",
    "type": "conference",
    "links": [],
    "authors": [
        "Varun Embar",
        "Jay Pujara",
        "Lise Getoor"
    ],
    "venue": "AKBC Workshop on Federated Knowledge Bases (FKBs)"
}